hi_message_one = "Привет\!\nДобро пожаловать в чат\-бот вселенной Yoonion 🤝\n\n" \
                 "За время конференции вы сможете\:\n" \
                 "\- Пройти четыре уровня и собрать коллекцию фирменного мерча 🎁\n"\
                 "\- Выиграть призы за достойное сражение в нашем квизе 🔥\n"\
                 "\- Подружиться с такими же как вы отважными багоборцами 🪲\n\n"\
                 "Играя в боте, вы соглашаетесь на обработку персональных данных:\n"\
                 "[Согласие на обработку](https://clck.ru/32h7MU)"

hi_message_second = "Наши приключения начинаются\!\n" \
                    "Создай свой игровой профиль, чтобы начать 🕹"